var game = 0, a, b, lenghtA = 13, lenghtB = 13, next, ans;

function start1() {
	game = 1;
	$("#brainMenu").css("display", "none");
	$("#gameTable").css("display", "inline");
	$("#brainhome").css("display", "block");
	$("#brainnext").css("display", "block");
	init();
	nextQuestion();
}
function start2() {
	game = 2;
	$("#brainMenu").css("display", "none");
	$("#gameTable").css("display", "inline");
	$("#brainhome").css("display", "block");
	$("#brainnext").css("display", "block");
	init();
	nextQuestion();
}
function start3() {
	game = 3;
	$("#brainMenu").css("display", "none");
	$("#gameTable").css("display", "inline");
	$("#brainhome").css("display", "block");
	$("#brainnext").css("display", "block");
	init();
	nextQuestion();
}
function startAll() {
	game = 4;
	$("#brainMenu").css("display", "none");
	$("#gameTable").css("display", "inline");
	$("#brainhome").css("display", "block");
	$("#brainnext").css("display", "block");
	init();
	nextQuestion();
}
function rand(max) {
	return Math.floor(Math.random( ) * (max + 1));
}
function nextQuestion() {
	$("#A").attr("onclick", "choise(this.id)");
	$("#B").attr("onclick", "choise(this.id)");
	$("#C").attr("onclick", "choise(this.id)");
	$("#D").attr("onclick", "choise(this.id)");
	$("#brainmessage").css("background-color", "transparent");
	$("#brainmessage").html("<br><br><br>");
	next = rand(lenghtA);
	categ = rand(1);
	if (categ == 0) {
		$(".ask").html(a[next][0]);
		$("#A").html(a[next][1]);
		$("#B").html(a[next][2]);
		$("#C").html(a[next][3]);
		$("#D").html(a[next][4]);
		ans = a[next][5];
	} else if (categ == 1) {
		$(".ask").html(b[next][0]);
		$("#A").html(b[next][1]);
		$("#B").html(b[next][2]);
		$("#C").html(b[next][3]);
		$("#D").html(b[next][4]);
		ans = b[next][5];
	}
}
function choise(data) {
	if (data == ans) {
		$("#brainmessage").css("background-color", "green");
		$("#brainmessage").html("Вітаємо, це правильна відповідь!<br><br><br>");
	} else {
		$("#brainmessage").css("background-color", "red");
		$("#brainmessage").html("Шкода, але відповідь не вірна...<br><br><br>");
	}
	$("#A").attr("onclick", "nextQuestion()");
	$("#B").attr("onclick", "nextQuestion()");
	$("#C").attr("onclick", "nextQuestion()");
	$("#D").attr("onclick", "nextQuestion()");
}

function init() {
	/*
	 * a
	 */
	a = new Array();
	a[0] = new Array();
	a[0][0] = "Які два числа діляться націло на 4 та 3?";
	a[0][1] = "36 і 9";
	a[0][2] = "36 і 48";
	a[0][3] = "9 і 16";
	a[0][4] = "48 і 9";
	a[0][5] = "B";
	
	a[1] = new Array();
	a[1][0] = "Яке чило, зменшене на 43, дорівнює 68?";
	a[1][1] = "25";
	a[1][2] = "111";
	a[1][3] = "101";
	a[1][4] = "15";
	a[1][5] = "B";
	
	a[2] = new Array();
	a[2][0] = "Назвіть чило, котре збільшене в 4 рази, дорівнює 164?";
	a[2][1] = "160";
	a[2][2] = "168";
	a[2][3] = "41";
	a[2][4] = "48";
	a[2][5] = "C";
	
	a[3] = new Array();
	a[3][0] = "Яке з перечилених чисел, є простим? (ділиться націло лише на 1 та на себе)";
	a[3][1] = "113";
	a[3][2] = "323";
	a[3][3] = "325";
	a[3][4] = "363";
	a[3][5] = "A";
	
	a[4] = new Array();
	a[4][0] = "Скільки буде 53% від 44/10?";
	a[4][1] = "1,94";
	a[4][2] = "1,55";
	a[4][3] = "3,33";
	a[4][4] = "2,33";
	a[4][5] = "D";
	
	a[5] = new Array();
	a[5][0] = "Які два числа в сумі дорівнюють 66, і співвідносяться як 2:9?";
	a[5][1] = "8 і 36";
	a[5][2] = "14 і 53";
	a[5][3] = "12 і 54";
	a[5][4] = "13 та 53";
	a[5][5] = "C";
	
	a[6] = new Array();
	a[6][0] = "Виберіть два числа, що в сумі дають 18, а в добутку 56.";
	a[6][1] = "12 і 6";
	a[6][2] = "14 і 4";
	a[6][3] = "15 і 3";
	a[6][4] = "10 і 8";
	a[6][5] = "B";
	
	a[7] = new Array();
	a[7][0] = "Яке чило, зменшене на 43, дорівнює 68?";
	a[7][1] = "25";
	a[7][2] = "111";
	a[7][3] = "101";
	a[7][4] = "15";
	a[7][5] = "B";
	
	a[8] = new Array();
	a[8][0] = "Знайдіть найбільший спільний дільник чисел: 672, 2, 6, 26.";
	a[8][1] = "14";
	a[8][2] = "2";
	a[8][3] = "6";
	a[8][4] = "26";
	a[8][5] = "A";
	
	a[9] = new Array();
	a[9][0] = "Яким буде результат операції: 10/4 - 6/2 + 4/6 + 5/2?";
	a[9][1] = "2,6(6)";
	a[9][2] = "2,35";
	a[9][3] = "1,8";
	a[9][4] = "2,3(3)";
	a[9][5] = "A";
	
	a[10] = new Array();
	a[10][0] = "Яким буде результат операції: 81 - 72 - 32 - 70?";
	a[10][1] = "-113";
	a[10][2] = "-93";
	a[10][3] = "-91";
	a[10][4] = "-54";
	a[10][5] = "B";
	
	a[11] = new Array();
	a[11][0] = "Яке чило зменшене у 7 раз, дасть результат 6?";
	a[11][1] = "13";
	a[11][2] = "-1";
	a[11][3] = "42";
	a[11][4] = "56";
	a[11][5] = "C";
	
	a[12] = new Array();
	a[12][0] = "Що з перечисленого, найближче до 0,583?";
	a[12][1] = "7/9";
	a[12][2] = "7/12";
	a[12][3] = "8/9";
	a[12][4] = "4/6";
	a[12][5] = "B";
	
	a[13] = new Array();
	a[13][0] = "Які знаки, потрібно поставити, замість знаків питання: 189 ? 331 ? 615 = 1135 ?";
	a[13][1] = "/ *";
	a[13][2] = "- +";
	a[13][3] = "* /";
	a[13][4] = "+ +";
	a[13][5] = "D";
	
	/*
	 * b
	 */
	b = new Array();
	b[0] = new Array();
	b[0][0] = "Підставте число, на місце зірочки.<br>04 10 10 30<br>10 10 06 94<br>07 05 05 30<br>07 01 06 *<br>";
	b[0][1] = "94";
	b[0][2] = "5";
	b[0][3] = "6";
	b[0][4] = "1";
	b[0][5] = "D";
	
	b[1] = new Array();
	b[1][0] = "Файл захищено паролем з шести знаків (числа в десятковій системі), скільки є варіантів пароля?";
	b[1][1] = "1000000";
	b[1][2] = "10000000";
	b[1][3] = "9999999";
	b[1][4] = "999999";
	b[1][5] = "A";
	
	b[2] = new Array();
	b[2][0] = "Куб з ребром 3м, розрізали на кубики, з ребрами 0,5м, скільки вийшло кубиків?";
	b[2][1] = "226";
	b[2][2] = "216";
	b[2][3] = "360";
	b[2][4] = "366";
	b[2][5] = "B";
	
	b[3] = new Array();
	b[3][0] = "Дві вантажівки, разом важать 330 одиниць ваги. Якщо легша важить на 15 одиниць менше, ніж половина другої, то яка вага легшої вантажівки?";
	b[3][1] = "90";
	b[3][2] = "106";
	b[3][3] = "86";
	b[3][4] = "100";
	b[3][5] = "A";
	
	b[4] = new Array();
	b[4][0] = "За круглим столом сидить група людей, на однаковій відстані один-від-одного, скільки людей за столом, якщо 9-й та 22-й сидять навпроти?";
	b[4][1] = "22";
	b[4][2] = "24";
	b[4][3] = "26";
	b[4][4] = "28";
	b[4][5] = "D";
	
	b[5] = new Array();
	b[5][0] = "Скільки може бути різних варіантів комбінацій результатів 5-ти партій з тенісу?";
	b[5][1] = "8";
	b[5][2] = "16";
	b[5][3] = "32";
	b[5][4] = "64";
	b[5][5] = "C";
	
	b[6] = new Array();
	b[6][0] = "70% населення міста, володіє автомобілем, 10% населення міста - мужчини, котрі мають авто, який відсоток населення, складають жінки-автовласниці?";
	b[6][1] = "69%";
	b[6][2] = "60%";
	b[6][3] = "85%";
	b[6][4] = "63%";
	b[6][5] = "B";
	
	b[7] = new Array();
	b[7][0] = "Ви вклали в банк 500 грошових одиниць, під 10% річних, скільки ви отримаєте, через 2 роки?";
	b[7][1] = "555";
	b[7][2] = "605";
	b[7][3] = "615";
	b[7][4] = "565";
	b[7][5] = "B";
	
	b[8] = new Array();
	b[8][0] = "Продовжіть логічний ряд: 6, 21, 66, 201, 606, ...";
	b[8][1] = "666";
	b[8][2] = "2010";
	b[8][3] = "1821";
	b[8][4] = "2662";
	b[8][5] = "C";
	
	b[9] = new Array();
	b[9][0] = "Андрію 46 років, його син, на 3 роки молодший, за половину його віку, скільки років синові?";
	b[9][1] = "21";
	b[9][2] = "23";
	b[9][3] = "29";
	b[9][4] = "26";
	b[9][5] = "B";
	
	b[10] = new Array();
	b[10][0] = "Враховуючи 15-ти відсоткову знижку, ви заплатили за телевізор 1190 грошових одиниць, яка повна вартість телевізора??";
	b[10][1] = "1110";
	b[10][2] = "1200";
	b[10][3] = "1140";
	b[10][4] = "1160";
	b[10][5] = "C";
	
	b[11] = new Array();
	b[11][0] = "На іподромі ви нарахували 94 ока та 148 ніг, скільки ж тут коней?";
	b[11][1] = "13";
	b[11][2] = "54";
	b[11][3] = "27";
	b[11][4] = "56";
	b[11][5] = "C";
	
	b[12] = new Array();
	b[12][0] = "Скільки потрібно кубиків, щоб зробити куб, з ребром у п'ять раз більшим?";
	b[12][1] = "25";
	b[12][2] = "125";
	b[12][3] = "1250";
	b[12][4] = "250";
	b[12][5] = "B";
	
	b[13] = new Array();
	b[13][0] = "На скільки градусів повернеться хвилинна стрілка годинника за 2,5 години??";
	b[13][1] = "640";
	b[13][2] = "360";
	b[13][3] = "960";
	b[13][4] = "900";
	b[13][5] = "D";
	
}